app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "testuser"], ["email", "test"], ["created_at", "2017-08-13 06:46:04.210405"], ["updated_at", "2017-08-13 06:46:04.210405"]]
---
    def create
      @user = User.new(params.require(:user).permit(:username, :email))

      @user.save